design_pattern/singleton.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Singleton</title>
<!-- 2019-04-11 Thu 18:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Bei Fang" />
<link rel="stylesheet" type="text/css" href="../style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Singleton</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Classic Implementation(lazy)</a></li>
<li><a href="#sec-2">2. Thread Safe</a></li>
<li><a href="#sec-3">3. Use "Double Checked Locking"</a></li>
<li><a href="#sec-4">4. Eager Instantiation</a></li>
<li><a href="#sec-5">5. Magic Static</a></li>
</ul>
</div>
</div>
<p>
The singleton pattern is a design pattern that restricts the instantiation
of a class to one object.
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Classic Implementation(lazy)</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-c++">class Singleton {
public:
  static Singleton *getInstance();
private:
  Singleton();
  static Singleton *instance_;
};
Singleton::Singleton() {}
Singleton *Singleton::instance_ = nullptr;
Singleton *Singleton::getInstance() {
  if (instance_ == nullptr)
    instance_ = new Singleton;
  return instance_;
}
</pre>
</div>
<p>
Here we have declared getInstance() static so that we can call it without
instantiating the class. The first time getInstance() is called it creates
a new singleton object and after that it returns the same object. This is
called lazy instantiation.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Thread Safe</h2>
<div class="outline-text-2" id="text-2">
<p>
The above method is that it is not thread safe. Multiple threads create
multiple objects for singleton. The follow implementation is thread safe.
</p>
<div class="org-src-container">

<pre class="src src-c++">mutex m;
class Singleton {
public:
  static Singleton *getInstance();
private:
  Singleton();
  static Singleton *instance_;
};
Singleton::Singleton() {}
Singleton *Singleton::instance_ = nullptr;
Singleton *Singleton::getInstance() {
  m.lock();
  if (instance_ == nullptr)
    instance_ = new Singleton;
  m.unlock();
  return instance_;
}
</pre>
</div>
<p>
Here using mutex makes sure that only one thread at a time can execute
getInstance(). The main disadvantage of this is method is that using mutex
every time while creating the singleton object is expensive and may decrease
the performance of your program.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Use "Double Checked Locking"</h2>
<div class="outline-text-2" id="text-3">
<p>
If you notice carefully once an object is created mutex is no longer useful
because now variable instance_ will not be null and any squence of operations
will lead to consistent results. So we will only acquire lock on the getInstance()
once, when the instance_ is null.
</p>
<div class="org-src-container">

<pre class="src src-c++">mutex m;
class Singleton {
public:
  static Singleton *getInstance();
private:
  Singleton();
  static Singleton *instance_;
};
Singleton::Singleton() {}
Singleton *Singleton::instance_ = nullptr;
Singleton *Singleton::getInstance() {
  if (instance_ == nullptr) {
    m.lock();
    if (instance_ == nullptr)
      instance_ = new Singleton;
    m.unlock();
  }
  return instance_;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Eager Instantiation</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-c++">class Singleton {
public:
  static Singleton *getInstance();
private:
  Singleton();
  static Singleton *instance_;
};
Singleton::Singleton() {}
Singleton *Singleton::instance_ = new Singleton();
Singleton *Singleton::getInstance() {
   return instance_;
}
</pre>
</div>
<p>
Here we have created instance of singleton in static initializer. This is
thread safe. Use this method only when your singleton class is light and 
is used throughout the execution of your program.
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Magic Static</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-c++">class Singleton final {
public:
  static Singleton &amp;getInstance();
private:
  Singleton() = default;
  ~Singleton() = default;

  Singleton(const Singleton&amp;) = delete;
  Singleton(Singleton&amp;&amp;) = delete;
  Singleton&amp; operator=(const Singleton&amp;) = delete;
  Singleton&amp; operator=(Singleton&amp;) = delete;
};

Singleton&amp; Singleton::getInstance() {
  static Singleton instance;
  return instance;
}
</pre>
</div>
<p>
Supported for c++11 and later versions.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bei Fang</p>
<p class="date">Created: 2019-04-11 Thu 18:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
